app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "price", "publishDate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "qwe"], ["author", "qwe"], ["price", 0.0], ["publishDate", "2021-10-01"], ["created_at", "2021-10-01 01:40:43.332862"], ["updated_at", "2021-10-01 01:40:43.332862"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "author" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author", "asdasdasdas"], ["updated_at", "2021-10-01 03:04:53.273840"], ["id", 16]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)